<h1>Pandas module & loading data </h2>

In [4]:
import pandas as pd

In [27]:
xls = pd.ExcelFile('yelp.xlsx')
df = xls.parse('yelp_data')

Il modulo Pandas consente l'accesso a diversi strumenti utili per l'analisi dei dati.Può connettersi ad un database ed interagire con esso.Inoltre può leggere e scrivere files Excel.Dopo aver importato pandas, con i metodo read_excel, si può "leggere un file excel in un dataframe".Un DataFrame è una struttura a due dimensioni, così come lo è un foglio di clcolo e una tabella di database.Il modulo Pandas fornisce anche una classe con il metodo  "parse".Grazie ad  esso , si può"leggere fogli specifici dei file excel, nel dataframe".Con l'esempio, sopra riportato, si caricherà il foglio "yelp_data" nel dataframe.Esso dunque verrà riempito con i dati delle attività commerciali di 13 città dello stato di Pennsylvania negli USA.Vediamo i primi 5 records.Questo file, riferisce il docente del corso  (Brandon Krakowsky-corso su Coursera, denominato "data analysis pandas"), è stato cortesemente lasciato scaricare dalla sfida avente tale nome.

In [28]:
df.head()

,name,category_0,category_1,take_out,review_count,stars,city_id,state_id
0,China Sea Chinese Restaurant,Restaurants,Chinese,True,11,2.5,1,1
1,Discount Tire Center,Tires,Automotive,False,24,4.5,1,1
2,Frankfurters,Restaurants,Hot Dogs,True,3,4.5,1,1
3,Fred Dietz Floral,Shopping,Flowers & Gifts,False,6,4.0,1,1
4,Kuhn's Market,Food,Grocery,False,8,3.5,1,1

Le categorie sono state assegnate da due diversi utenti.Sono indicate le totalità di recensioni disponibili e il numero di stelle assegnate all'esercizio.Negli altri due fogli del foglio elettronico sono elencati identificatori univoci e rispettivi nomi delle due entità :città e stato.

In [29]:
type(df)

pandas.core.frame.DataFrame

In [30]:
len(df)

600

Sopra abbiamo scoperto di quante righe, tale foglio, fosse composto

In [31]:
df.shape

(600, 8)

ci sono 600 righe e 8 colonne

In [33]:
df.shape

(600, 12)

In [10]:
df.dtypes

name             object
category_0       object
category_1       object
take_out           bool
review_count      int64
stars           float64
city_id           int64
state_id          int64
dtype: object

In tal modo si conosce il tipo di ciascuna colonna

In [11]:
df.describe()

       review_count       stars     city_id    state_id
count    600.000000  600.000000  600.000000  600.000000
mean      33.771667    3.495000    9.193333    1.500000
std       86.901895    0.955596    2.997933    0.500417
min        3.000000    1.000000    1.000000    1.000000
25%        5.000000    3.000000    8.000000    1.000000
50%       10.000000    3.500000   10.500000    1.500000
75%       25.250000    4.000000   12.000000    2.000000
max     1305.000000    5.000000   13.000000    2.000000

tale metodo fornisce statistiche riassuntive, per ciascuna colonna purchè numerica

In [12]:
df.head(6)

,name,category_0,category_1,take_out,review_count,stars,city_id,state_id
0,China Sea Chinese Restaurant,Restaurants,Chinese,True,11,2.5,1,1
1,Discount Tire Center,Tires,Automotive,False,24,4.5,1,1
2,Frankfurters,Restaurants,Hot Dogs,True,3,4.5,1,1
3,Fred Dietz Floral,Shopping,Flowers & Gifts,False,6,4.0,1,1
4,Kuhn's Market,Food,Grocery,False,8,3.5,1,1
5,Lincoln Bakery,Food,Bakeries,True,25,4.0,1,1

il metodo sopra fornisce, dall'inizio,  il numero di righe presente come argomento, se presente, altrimenti le prime 5

In [19]:
df=df.drop_duplicates()

il metodo sopra elimina le righe che hanno tutti i valori delle celle uguali ad altre righe (in relazione a tutte le colonne)

In [20]:
df["name"]

0                           China Sea Chinese Restaurant
1                                   Discount Tire Center
2                                           Frankfurters
3                                      Fred Dietz Floral
4                                          Kuhn's Market
                             ...
595    Republic Services of Southern Nevada Recycling...
596                                         SA Recycling
597                                      Jack In the Box
598                                 Custom Hearth & Door
599                                     A Sunrise Towing
Name: name, Length: 600, dtype: object

Sopra ho visualizzato elementi (i primi e gli ultimi) della colonna "name"

In [35]:
atts=["name","city_id","state_id"]
df[atts].head(100)

                                              name  city_id  state_id
0                     China Sea Chinese Restaurant        1         1
1                             Discount Tire Center        1         1
2                                     Frankfurters        1         1
3                                Fred Dietz Floral        1         1
4                                    Kuhn's Market        1         1
..                                             ...      ...       ...
95                             Aamco Transmissions        8         1
96  Animal Rescue League Shelter & Wildlife Center        8         1
97                          Aracri's Greentree Inn        8         1
98                           Atch-Mont Real Estate        8         1
99                              Atria's Restaurant        8         1

[100 rows x 3 columns]

Abbiamo usato i nomi di alcuni attrbuti per estrarre solo quelle colonne, visualizzando, poi, le prime 100 righe

In [36]:
df_states = xls.parse('states')
df = pd.merge(left=df, right=df_states, how='inner', left_on='state_id', right_on='id')
df_cities = xls.parse('cities')
df = pd.merge(left=df, right=df_cities, how='inner', left_on='city_id', right_on='id')

In [37]:
df.head(6)

,name,category_0,category_1,take_out,review_count,stars,city_id,state_id,id_x,state_x,id_y,city_x,id_x,state_y,id_y,city_y
0,China Sea Chinese Restaurant,Restaurants,Chinese,True,11,2.5,1,1,1,PA,1,Bellevue,1,PA,1,Bellevue
1,Discount Tire Center,Tires,Automotive,False,24,4.5,1,1,1,PA,1,Bellevue,1,PA,1,Bellevue
2,Frankfurters,Restaurants,Hot Dogs,True,3,4.5,1,1,1,PA,1,Bellevue,1,PA,1,Bellevue
3,Fred Dietz Floral,Shopping,Flowers & Gifts,False,6,4.0,1,1,1,PA,1,Bellevue,1,PA,1,Bellevue
4,Kuhn's Market,Food,Grocery,False,8,3.5,1,1,1,PA,1,Bellevue,1,PA,1,Bellevue
5,Lincoln Bakery,Food,Bakeries,True,25,4.0,1,1,1,PA,1,Bellevue,1,PA,1,Bellevue

Abbiamo messo insieme anche la colonna dei nomi delle città e quella dei nomi degli stati facendo uso di un "inner join" consentito dalla presenza di una colonna ( campo identificatore) nelle due piccole tabelle, colonna  già presente nella tabella più grande.Questo avviene in similitudine a quanto si fa sui database relazionali.Esso combina i dataframes basandosi sulla chiave di join.Viene restituito un dataframe che contiene solo i record con gli identificatori comuni.In altre parole, il dataframe restituito contiene solo le righe dove i valori da combinare sono presenti in entrambe le tabelle.the pandas function per eseguire l'unione combinata è chiamata "merge".Così, a sinistra (on the left) io indico il dataframe df e alla destra (on the right) quello denominato df_cities.Il dataframe risultante si chiamerà sempre df

In [39]:
df.shape

(600, 16)

In [40]:
del df['id_x']

In [42]:
del df['id_y']

In [43]:
df.shape

(600, 12)

Sopra, l'istruzione del ci ha permesso di eliminare le colonne che erano presenti con ridondanza